stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_Broadcast_Speaker/Core/Src/app_entry.c
#endif  /* CFG_JOYSTICK_SUPPORTED */

/**
  * @brief Configure PLL for the audio frequency, PLL output is used for the SAI peripheral and as the core clock
  * @retval None
  */
void AudioClock_Init(uint32_t audio_frequency_type)
{
  uint32_t target_freq;
  if (audio_frequency_type == SAMPLE_FREQ_44100_HZ)
  {
    target_freq = 90316800;
  }
  else
  {
    /* valid for 8k, 16k, 24k, 32k or 48k */
    target_freq = 98304000;
  }

  if ( target_freq !=  PLL_Target_Clock_Freq )
  {
    scm_pll_config_t pll_config;
    LOG_INFO_APP("Audio Clock Initialization\n");

    pll_config.pll_mode = PLL_FRACTIONAL_MODE;
    pll_config.PLLM = 6;
    pll_config.PLLP = 4;
    pll_config.PLLQ = 4;
    pll_config.PLLR = 4;

    /* VCO frequency should be in range 128 to 544 MHz */
    /* PLL fractionnal should allows to cover +/-550ppm around the targeted frequency*/
    if (target_freq == 90316800)
    {
      pll_config.PLLN = 67;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (67 + 1) = 362.7 MHz */
      pll_config.PLLFractional = 6042;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_3;
      /* PLLSYS = 90.31673 MHz */
    }
    else
    {
      pll_config.PLLN = 73;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (73 + 1) = 394.7 MHz */
      pll_config.PLLFractional = 5964;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_4;
      /* PLLSYS = 98.30396 MHz */
    }

    UTIL_LPM_SetStopMode(1 << CFG_LPM_AUDIO, UTIL_LPM_DISABLE);

    scm_pll_setconfig(&pll_config);

    scm_setsystemclock(SCM_USER_APP, SYS_PLL);

    /* enable P output used for the audio timer */
    LL_RCC_PLL1_EnableDomain_PLL1P();

    PLL_Target_Clock_Freq = target_freq;
  }
  else
  {
    LOG_INFO_APP("Audio Clock already configured\n");
  }
}

void PLL_Ready_ProcessIT(void)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_PLL_READY_ID, CFG_SEQ_PRIO_0);
}

void PLL_Ready_Task(void)
{
  /* set Link Layer audio timings */
  uint32_t iso_exec_time;
  Evnt_timing_t event_time;
  event_time.drift_time    = ISO_PLL_DRIFT_TIME;
  event_time.exec_time     = ISO_PLL_EXEC_TIME;
  event_time.schdling_time = ISO_PLL_SCHDL_TIME;

#if defined(__GNUC__) && defined(DEBUG)
  event_time.drift_time += ISO_PLL_DRIFT_TIME_EXTRA_GCC_DEBUG;
  event_time.exec_time += ISO_PLL_EXEC_TIME_EXTRA_GCC_DEBUG;
#endif

  ll_intf_config_schdling_time(&event_time, &iso_exec_time);

  CODEC_CLK_Init();

  AUDIO_PLLConfig_t corrector_pll_config;
  corrector_pll_config.PLLTargetFreq = PLL_Target_Clock_Freq;
  corrector_pll_config.VCOInputFreq = (32000000.0f / 6.0f); /* HSE / PLL_M */
  corrector_pll_config.PLLOutputDiv = 4; /* PLL_P */
  AUDIO_InitializeClockCorrector(&corrector_pll_config, 500, 4000);

  /* I2C init takes a long time, it is better to do it before CIS establishement */
  BSP_I2C1_Init();
}

void PLL_Exit(void)
{
  if (PLL_Target_Clock_Freq != 0)
  {
    scm_setsystemclock(SCM_USER_APP, NO_CLOCK_CONFIG);

    PLL_Target_Clock_Freq = 0;

    UTIL_LPM_SetStopMode(1 << CFG_LPM_AUDIO, UTIL_LPM_ENABLE);
  }
}


static void AudioClock_Deinit( void )
{
  /* back to default timings */
  Evnt_timing_t event_time;
  event_time.drift_time    = DRIFT_TIME_DEFAULT;
  event_time.exec_time     = EXEC_TIME_DEFAULT;
  event_time.schdling_time = SCHDL_TIME_DEFAULT;

#if defined(__GNUC__) && defined(DEBUG)
  event_time.drift_time += DRIFT_TIME_EXTRA_GCC_DEBUG;
  event_time.exec_time += EXEC_TIME_EXTRA_GCC_DEBUG;
#endif

  ll_intf_config_schdling_time(&event_time, &gDefault_Exec_Time);

  LOG_INFO_APP("Audio Clock Deinitialization\n");

  AUDIO_DeinitializeClockCorrector();
}

HAL_StatusTypeDef MX_SAI1_ClockConfig(SAI_HandleTypeDef *hsai, uint32_t SampleRate)
{
  /* PLL already configured */

  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_SAI1;
  PeriphClkInit.Sai1ClockSelection = RCC_SAI1CLKSOURCE_PLL1P;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }

  __HAL_RCC_SAI1_CLK_ENABLE();

  return HAL_OK;
}

/**
  * @brief Adjust microphone gain using 3 pre-set configuration
  * @note  To be used at the initialization only, after BSP_AUDIO_xx_Init()
  * @param mode : value from 0 to 2, 0 for lowest gain and 2 for the highest
  */
static void BSP_MIC_Gain_Init(const uint8_t mode)
{
  const uint16_t Tab_vol_left[3] = {0x01A8, 0x01C0, 0x01FF};

  if( mode > 2)
  {
    Error_Handler();
  }
  else
  {
    uint8_t tmp[2];

    tmp[0] = (uint8_t)(Tab_vol_left[mode] >> 8);
    tmp[1] = (uint8_t)(Tab_vol_left[mode]);

    BSP_I2C1_WriteReg(AUDIO_I2C_ADDRESS, WM8904_ADC_DIGITAL_VOL_LEFT, tmp, 0x02);
  }
}

void MX_AudioInit(Audio_Role_t role,
                  Sampling_Freq_t sampling_frequency,
                  Frame_Duration_t frame_duration,
                  uint8_t *pSnkBuff,
                  uint8_t *pSrcBuff)
{
  uint32_t sample_per_frame;
  uint32_t audioFrequency;
  uint32_t channel_at_src;
  BSP_AUDIO_Init_t audio_conf;

  switch (sampling_frequency)
  {
    case SAMPLE_FREQ_8000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_8K;
      if (pSrcBuff == NULL)
        gAudio_Config = audio_persist_get_config_index_from_name("media8kHz");
      else
        gAudio_Config = audio_persist_get_config_index_from_name("telephony8kHz");
      break;

    case SAMPLE_FREQ_16000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_16K;
      if (pSrcBuff == NULL)
        gAudio_Config = audio_persist_get_config_index_from_name("media16kHz");
      else
        gAudio_Config = audio_persist_get_config_index_from_name("telephony16kHz");
      break;

    case SAMPLE_FREQ_24000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_24K;
      if (pSrcBuff == NULL)
        gAudio_Config = audio_persist_get_config_index_from_name("media24kHz");
      else
        gAudio_Config = audio_persist_get_config_index_from_name("telephony24kHz");
      break;

    case SAMPLE_FREQ_32000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_32K;
      if (pSrcBuff == NULL)
        gAudio_Config = audio_persist_get_config_index_from_name("media32kHz");
      else
        gAudio_Config = audio_persist_get_config_index_from_name("telephony32kHz");
      break;

    case SAMPLE_FREQ_48000_HZ:
      audioFrequency = SAI_AUDIO_FREQUENCY_48K;
      if (pSrcBuff == NULL)
        gAudio_Config = audio_persist_get_config_index_from_name("media48kHz");
      else
        Error_Handler(); // telephony at 48Khz not supported
      break;

    default:
      Error_Handler();
      return;
  }

