stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_Broadcast_Speaker/Core/Src/app_entry.c
  if (sampling_frequency == SAMPLE_FREQ_44100_HZ)
  {
    /* LC3 need setup like 48Khz for this frequency */
    sampling_frequency = SAMPLE_FREQ_48000_HZ;
  }

	switch(frame_duration)
	{
      case FRAME_DURATION_7_5_MS:
        sample_per_frame = audioFrequency * 75 / 10000;
        Error_Handler(); /* not supported in this demo */
        break;

      case FRAME_DURATION_10_MS:
        /* sample per LC3 frame, may be devided later if UTIL_AUDIO_N_MS_PER_INTERRUPT is not 10ms */
        sample_per_frame = audioFrequency * 100 / 10000;
        if (10 % UTIL_AUDIO_N_MS_PER_INTERRUPT != 0)
        {
          Error_Handler();
        }
        ITRatio = 10 / UTIL_AUDIO_N_MS_PER_INTERRUPT;
        OutITRatio_cnt = 0;
        InITRatio_cnt = 0;
        break;

      default:
        Error_Handler();
        return;
	}


  __HAL_RCC_I2C1_CLK_ENABLE();

  audio_conf.Device = AUDIO_IN_DEVICE_ANALOG_MIC;
  audio_conf.ChannelsNbr = 1;
  channel_at_src = 1;

  audio_conf.Volume = Current_Volume; /* input volume is not used */
  audio_conf.SampleRate = audioFrequency;
  audio_conf.BitsPerSample = AUDIO_RESOLUTION_16B;

  if (BSP_AUDIO_IN_Init(0x00, &audio_conf) != BSP_ERROR_NONE)
  {
    Error_Handler();
    /* Release Bus for power consumption optimisation */
    __HAL_RCC_I2C1_CLK_DISABLE();
    return;
  }

  audio_conf.Device = AUDIO_OUT_DEVICE_HEADPHONE;
  audio_conf.ChannelsNbr = (pSrcBuff == NULL)? 2 : 1; /* when duplex, we use mono */
  audio_conf.Volume = Current_Volume;
  if (BSP_AUDIO_OUT_Init(0x00, &audio_conf) != BSP_ERROR_NONE)
  {
    Error_Handler();
    /* Release Bus for power consumption optimisation */
    __HAL_RCC_I2C1_CLK_DISABLE();
    return;
  }

  BSP_MIC_Gain_Init(MIC_GAIN_CONFIG);
  BSP_AUDIO_OUT_SetVolume(0, Current_Volume);

  /* Start SAI clock without DMA interrupt */
  uint8_t channel_at_snk = (pSrcBuff == NULL)? 2 : 1;   /* SAI is in stereo for Headset */
  uint8_t buffer_nb = 2;        /* double buffer strategy for minimum latency*/
  uint8_t bytes_per_sample = 2;

  /* init may depend on the audio frequency (takes less than 100ms) */
  main_hooks_audioInit();
  /* we don't use stm32_audio.c for init the BSP (callback not registered), only for buffer allocation */
  UTIL_AUDIO_init((pSrcBuff == NULL)? 0 : 1);
  UTIL_AUDIO_start();

  Sink_frame_size = (sample_per_frame * channel_at_snk * buffer_nb) / ITRatio;
  Source_frame_size = (sample_per_frame * channel_at_src * buffer_nb) / ITRatio;
  /* Start SAI clock without DMA interrupt */
  Init_AudioBuffer((uint8_t *)pSnkBuff,
                   Sink_frame_size * bytes_per_sample,
                   (uint8_t *)pSrcBuff,
                   Source_frame_size * bytes_per_sample);

  /* Release Bus for power consumption optimisation */
  __HAL_RCC_I2C1_CLK_DISABLE();
  MxAudioInit_Flag = 1;
}

void MX_AudioDeInit(void)
{
  if (MxAudioInit_Flag == 1)
  {
    MxAudioInit_Flag = 0;

    __HAL_RCC_I2C1_CLK_ENABLE();

    if (BSP_AUDIO_IN_DeInit(0x00) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }

    if (BSP_AUDIO_OUT_DeInit(0x00) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }

    BSP_I2C1_DeInit();
    SET_BIT(haudio_in_sai.Instance->CR2, SAI_xCR2_FFLUSH);
    SET_BIT(haudio_out_sai.Instance->CR2, SAI_xCR2_FFLUSH);

    UTIL_AUDIO_stop();
    UTIL_AUDIO_deinit();
    main_hooks_audioDeInit();

    UTIL_AUDIO_RENDER_clearBuffer();

    /* Clear Capture scratch buffer */
    memset(aLC3OutBuff, 0, Sink_frame_size*ITRatio*sizeof(uint16_t));

    memset(aSrcBuff, 0, Source_frame_size*sizeof(uint16_t));

  }

  AudioClock_Deinit();
}

static void Init_AudioBuffer(uint8_t *pSnkBuff, uint16_t SnkBuffLen, uint8_t *pSrcBuff, uint16_t SrcBuffLen)
{
  /* We start the SAI here but will pause the DMA on the first interrupt.
     The DMA will be relauched synchronized to the BLE transport for mastering audio latency */
  if ((SnkBuffLen  > 0) && (pSnkBuff != NULL))
  {
    if (BSP_AUDIO_OUT_Play(0, (uint8_t *)pSnkBuff, SnkBuffLen) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }
    Play_Req_Pause = 1;
  }
  if ((SrcBuffLen  > 0) && (pSrcBuff != NULL))
  {
    if (BSP_AUDIO_IN_Record(0, (uint8_t *)pSrcBuff, SrcBuffLen) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }
    Record_Req_Pause = 1;
  }
}

int32_t Start_TxAudio(void)
{
  int32_t status = 1;

  /* restart DMA request only if it was on pause */
  if ((haudio_out_sai.Instance->CR1 & SAI_xCR1_DMAEN) == 0)
  {
    SET_BIT(haudio_out_sai.Instance->CR2, SAI_xCR2_FFLUSH);
    haudio_out_sai.Instance->CR1 |= SAI_xCR1_DMAEN;
    status = 0;

    OutPingPong = 0;
    pOutLC3data = &aLC3OutBuff[Sink_frame_size*ITRatio/2];
    BSP_AUDIO_OUT_TransferComplete_CallBack(0);
  }

  return status;
}

void Stop_TxAudio(void)
{
  /* Initialize Bus which bas been released for Power consumption optimisation */
 __HAL_RCC_I2C1_CLK_ENABLE();

  if (BSP_AUDIO_OUT_Stop(0) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }

  /* Release Bus for power consumption optimisation */
  __HAL_RCC_I2C1_CLK_DISABLE();
}

static void App_AudioKit_OutProcessMngr(void)
{
  /* copy data to audio kit in */
  UTIL_AUDIO_CAPTURE_TxComplete_cb((pOutLC3data-&aLC3OutBuff[0])*sizeof(uint16_t), MAIN_PATH);

  pOutLC3data += Sink_frame_size/2;
  if (pOutLC3data == &aLC3OutBuff[Sink_frame_size*ITRatio])
  {
    pOutLC3data = &aLC3OutBuff[0]; //loop
  }

  /* trigger of LC3 processing */
  if (OutITRatio_cnt == 0)
  {
    if (OutPingPong)
      APP_NotifyTxAudioCplt(ITRatio*Sink_frame_size);
    else
      APP_NotifyTxAudioHalfCplt();

    OutPingPong ^= 1;
  }

  OutITRatio_cnt++;
  OutITRatio_cnt = OutITRatio_cnt%ITRatio;

  /* trigger of audiokit processing */
  UTIL_AUDIO_process();
}


void BSP_AUDIO_OUT_TransferComplete_CallBack(uint32_t instance)
{

  /* provide ptr to audio kit output to peripheral */
  UTIL_AUDIO_RENDER_TxComplete_cb(UTIL_AUDIO_RENDER_getHalfAddr(MAIN_PATH), MAIN_PATH);

  App_AudioKit_OutProcessMngr();
}

void BSP_AUDIO_OUT_HalfTransfer_CallBack(uint32_t instance)
{
  if (MxAudioInit_Flag == 1)
  {
    if (Play_Req_Pause == 1)
    {
      /* Pause the DMA aligned on a interrupt and wait the codec trigger to restart it synchronized to BLE */
      haudio_out_sai.Instance->CR1 &= ~SAI_xCR1_DMAEN;

      Play_Req_Pause = 0;
    }
    else
    {
      /* provide ptr to audio kit output to peripheral */
      UTIL_AUDIO_RENDER_TxComplete_cb(UTIL_AUDIO_RENDER_getBaseAddr(MAIN_PATH), MAIN_PATH);

      App_AudioKit_OutProcessMngr();
    }
  }
}

int32_t Start_RxAudio(void)
{
  int32_t status = 1;

  /* restart DMA request only if it was on pause */
  if ((haudio_in_sai.Instance->CR1 & SAI_xCR1_DMAEN) == 0)
  {
    SET_BIT(haudio_in_sai.Instance->CR2, SAI_xCR2_FFLUSH);
    haudio_in_sai.Instance->CR1 |= SAI_xCR1_DMAEN;
    status = 0;
  }

  InPingPong = 0;
  pInLC3data = aLC3InBuff;
  return status;
}

void Stop_RxAudio(void)
{
  /* Initialize Bus which bas been released for Power consumption optimisation */
  __HAL_RCC_I2C1_CLK_ENABLE();

  if (BSP_AUDIO_IN_Stop(0) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }

