stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_Broadcast_Speaker/Core/Src/app_entry.c
  /* Release Bus for power consumption optimisation */
  __HAL_RCC_I2C1_CLK_DISABLE();
}

static void App_AudioKit_INPreparation(void)
{
  /* provide ptr to audio kit output to BLE LC3 IN buffer */
  /* the processing at In is aligned on DMA out interrupt in this project, so we have to delay one more DMA frame */
  UTIL_AUDIO_RENDER_TxComplete_cb(pInLC3data, ALTERNATE_PATH);


  pInLC3data += Source_frame_size/2; //add size of a half DMA frame
  if (pInLC3data == &aLC3InBuff[Source_frame_size*ITRatio])
  {
    pInLC3data = &aLC3InBuff[0]; //loop
  }

  InITRatio_cnt++;
  InITRatio_cnt = InITRatio_cnt%ITRatio;

  /* trigger of LC3 encoding */
  if (InITRatio_cnt == 0)
  {
    if (InPingPong)
      APP_NotifyRxAudioHalfCplt(); // first buffer
    else
      APP_NotifyRxAudioCplt(Source_frame_size*ITRatio); // second buffer

    InPingPong ^= 1; // toogle ping pong
  }
}


void BSP_AUDIO_IN_TransferComplete_CallBack(uint32_t instance)
{
  App_AudioKit_INPreparation();

  /* copy from SAI input to audiokit in */
  UTIL_AUDIO_CAPTURE_TxComplete_cb(Source_frame_size, ALTERNATE_PATH);
}

void BSP_AUDIO_IN_HalfTransfer_CallBack(uint32_t instance)
{
  if (MxAudioInit_Flag == 1)
  {
    if (Record_Req_Pause == 1)
    {
      /* Pause the DMA aligned on a interrupt and wait the codec trigger to restart it synchronized to BLE */
      haudio_in_sai.Instance->CR1 &= ~SAI_xCR1_DMAEN;

      Record_Req_Pause = 0;
    }
    else
    {
      App_AudioKit_INPreparation();

      /* copy from SAI input to audiokit in */
      UTIL_AUDIO_CAPTURE_TxComplete_cb(0, ALTERNATE_PATH);
    }
  }
}

void Set_Volume(uint8_t Volume)
{
  Current_Volume = VOLUME_VCP_TO_VOLUME_BSP(Volume);

  __HAL_RCC_I2C1_CLK_ENABLE();
  BSP_AUDIO_OUT_SetVolume(0, Current_Volume);
  __HAL_RCC_I2C1_CLK_DISABLE();
}
/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

void UTIL_SEQ_Idle( void )
{
#if ( CFG_LPM_LEVEL != 0)
  HAL_SuspendTick();
#if (CFG_SCM_SUPPORTED == 1)
  /* SCM HSE BEGIN */
  SCM_HSE_StopStabilizationTimer();
  /* SCM HSE END */
#endif /* CFG_SCM_SUPPORTED */
  UTIL_LPM_EnterLowPower();
  HAL_ResumeTick();
#endif /* CFG_LPM_LEVEL */
  return;
}

void UTIL_SEQ_PreIdle( void )
{
  /* USER CODE BEGIN UTIL_SEQ_PreIdle_1 */

  /* USER CODE END UTIL_SEQ_PreIdle_1 */
#if ( CFG_LPM_LEVEL != 0)
  LL_PWR_ClearFlag_STOP();

  if ( ( system_startup_done != FALSE ) && ( UTIL_LPM_GetMode() == UTIL_LPM_OFFMODE ) )
  {
    APP_SYS_BLE_EnterDeepSleep();
  }

  LL_RCC_ClearResetFlags();

#if defined(STM32WBAXX_SI_CUT1_0)
  /* Wait until HSE is ready */
#if (CFG_SCM_SUPPORTED == 1)
  /* SCM HSE BEGIN */
  SCM_HSE_WaitUntilReady();
  /* SCM HSE END */
#else
  while (LL_RCC_HSE_IsReady() == 0);
#endif /* CFG_SCM_SUPPORTED */

  UTILS_ENTER_LIMITED_CRITICAL_SECTION(RCC_INTR_PRIO << 4U);
  scm_hserdy_isr();
  UTILS_EXIT_LIMITED_CRITICAL_SECTION();
#endif /* STM32WBAXX_SI_CUT1_0 */
#endif /* CFG_LPM_LEVEL */
  /* USER CODE BEGIN UTIL_SEQ_PreIdle_2 */

  /* USER CODE END UTIL_SEQ_PreIdle_2 */
  return;
}

void UTIL_SEQ_PostIdle( void )
{
  /* USER CODE BEGIN UTIL_SEQ_PostIdle_1 */

  /* USER CODE END UTIL_SEQ_PostIdle_1 */
#if ( CFG_LPM_LEVEL != 0)
  LL_AHB5_GRP1_EnableClock(LL_AHB5_GRP1_PERIPH_RADIO);
  (void)ll_sys_dp_slp_exit();
  UTIL_LPM_SetOffMode(1U << CFG_LPM_LL_DEEPSLEEP, UTIL_LPM_ENABLE);
#endif /* CFG_LPM_LEVEL */
  /* USER CODE BEGIN UTIL_SEQ_PostIdle_2 */
#if ( (CFG_LPM_LEVEL != 0) && ( CFG_LPM_STDBY_SUPPORTED != 0 ) )
  APP_BSP_PostIdle();
#endif /* ( CFG_LPM_LEVEL && CFG_LPM_STDBY_SUPPORTED ) */
  /* USER CODE END UTIL_SEQ_PostIdle_2 */
  return;
}

void BPKACB_Process( void )
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_BPKA, CFG_SEQ_PRIO_0);
}

/**
 * @brief Callback used by Random Number Generator to launch Task to generate Random Numbers
 */
void HWCB_RNG_Process( void )
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_HW_RNG, TASK_PRIO_RNG);
}

void AMM_RegisterBasicMemoryManager (AMM_BasicMemoryManagerFunctions_t * const p_BasicMemoryManagerFunctions)
{
  /* Fulfill the function handle */
  p_BasicMemoryManagerFunctions->Init = AMM_WrapperInit;
  p_BasicMemoryManagerFunctions->Allocate = AMM_WrapperAllocate;
  p_BasicMemoryManagerFunctions->Free = AMM_WrapperFree;
}

void AMM_ProcessRequest(void)
{
  /* Trigger to call Advance Memory Manager process function */
  UTIL_SEQ_SetTask(1U << CFG_TASK_AMM, CFG_SEQ_PRIO_0);
}

static void AMM_WrapperInit(uint32_t * const p_PoolAddr, const uint32_t PoolSize)
{
  UTIL_MM_Init ((uint8_t *)p_PoolAddr, ((size_t)PoolSize * sizeof(uint32_t)));
}

static uint32_t * AMM_WrapperAllocate(const uint32_t BufferSize)
{
  return (uint32_t *)UTIL_MM_GetBuffer (((size_t)BufferSize * sizeof(uint32_t)));
}

static void AMM_WrapperFree (uint32_t * const p_BufferAddr)
{
  UTIL_MM_ReleaseBuffer ((void *)p_BufferAddr);
}

void FM_ProcessRequest(void)
{
  /* Trigger to call Flash Manager process function */
  UTIL_SEQ_SetTask(1U << CFG_TASK_FLASH_MANAGER, CFG_SEQ_PRIO_0);
}

#if ((CFG_LOG_SUPPORTED == 0) && (CFG_LPM_LEVEL != 0))
/* RNG module turn off HSI clock when traces are not used and low power used */
void RNG_KERNEL_CLK_OFF(void)
{
  /* USER CODE BEGIN RNG_KERNEL_CLK_OFF_1 */

  /* USER CODE END RNG_KERNEL_CLK_OFF_1 */
  LL_RCC_HSI_Disable();
  /* USER CODE BEGIN RNG_KERNEL_CLK_OFF_2 */

  /* USER CODE END RNG_KERNEL_CLK_OFF_2 */
}

#if (CFG_SCM_SUPPORTED == 1)
/* SCM module turn off HSI clock when traces are not used and low power used */
void SCM_HSI_CLK_OFF(void)
{
  /* USER CODE BEGIN SCM_HSI_CLK_OFF_1 */

  /* USER CODE END SCM_HSI_CLK_OFF_1 */
  LL_RCC_HSI_Disable();
  /* USER CODE BEGIN SCM_HSI_CLK_OFF_2 */

  /* USER CODE END SCM_HSI_CLK_OFF_2 */
}
#endif /* CFG_SCM_SUPPORTED */
#endif /* ((CFG_LOG_SUPPORTED == 0) && (CFG_LPM_LEVEL != 0)) */

#if (CFG_LOG_SUPPORTED != 0)
void UTIL_ADV_TRACE_PreSendHook(void)
{
#if (CFG_LPM_LEVEL != 0)
  /* Disable Stop mode before sending a LOG message over UART */
  UTIL_LPM_SetStopMode(1U << CFG_LPM_LOG, UTIL_LPM_DISABLE);
#endif /* (CFG_LPM_LEVEL != 0) */
  /* USER CODE BEGIN UTIL_ADV_TRACE_PreSendHook */
#if (CFG_TEST_VALIDATION == 1)
#if ((CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED == 1))
    UTIL_LPM_SetOffMode(1U << CFG_LPM_LOG, UTIL_LPM_DISABLE);
#endif /* ((CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED == 1)) */
#endif /* (CFG_TEST_VALIDATION == 1) */
  /* USER CODE END UTIL_ADV_TRACE_PreSendHook */
}

void UTIL_ADV_TRACE_PostSendHook(void)
{
#if (CFG_LPM_LEVEL != 0)
  /* Enable Stop mode after LOG message over UART sent */
  UTIL_LPM_SetStopMode(1U << CFG_LPM_LOG, UTIL_LPM_ENABLE);
#endif /* (CFG_LPM_LEVEL != 0) */
  /* USER CODE BEGIN UTIL_ADV_TRACE_PostSendHook */
#if (CFG_TEST_VALIDATION == 1)
#if ((CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED == 1))
    UTIL_LPM_SetOffMode(1U << CFG_LPM_LOG, UTIL_LPM_ENABLE);
#endif /* ((CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED == 1)) */
#endif /* (CFG_TEST_VALIDATION == 1) */
  /* USER CODE END UTIL_ADV_TRACE_PostSendHook */
}

/**
 * @brief  Treat Serial commands.
 *
 * @param  pRxBuffer      Pointer on received data from USART.
 * @param  iRxBufferSize  Number of received data.
 * @retval None
 */
void Serial_CMD_Interpreter_CmdExecute( uint8_t * pRxBuffer, uint16_t iRxBufferSize )
{
  /* USER CODE BEGIN Serial_CMD_Interpreter_CmdExecute_1 */

  /* USER CODE END Serial_CMD_Interpreter_CmdExecute_1 */
}

#endif /* (CFG_LOG_SUPPORTED != 0) */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin)
{
  HAL_GPIO_EXTI_Rising_Callback(GPIO_Pin);
}

/* USER CODE END FD_WRAP_FUNCTIONS */
